tap "homebrew/bundle"
brew "cmake"
brew "mas"
brew "pyenv"
brew "tree"
cask "1password"
cask "android-studio"
cask "cron"
cask "docker"
cask "firefox"
cask "kindle"
cask "notion"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Mendeley Web Importer", id: 1577516695
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "twxs.cmake"
vscode "vscodevim.vim"
